back-end/app/controllers/profiles_controller.rb

    def index
      if params[:search]
        @profiles = User.search(params[:search])
---
SELECT "users".* FROM "users"

    def show
      @profile = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

      def set_profile
        @profile = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]